package name

import (
	"math/rand"
	"strings"
	"time"
)

const nickName = `豹虎,蜂猴,熊猴,叶猴,紫貂,貂熊,熊狸,云豹,雪豹,儒艮,黑麂,野马,鼷鹿,坡鹿,豚鹿,麋鹿,野牛,藏羚,河狸,台湾猴,豚尾猴,金丝猴
,长臂猿,大熊猫,白暨豚,亚洲象,野骆驼,白唇鹿,梅花鹿,野牦牛,扭角羚,赤斑羚,塔尔羊,北山羊,马来熊,野驴,普氏原羚,高鼻羚羊,鬣羚,白海豚
,鼋蟒,鳄蜥,巨蜥,扬子鳄,四爪陆龟,鸟,白鹳,黑鹳,朱鹮,金雕,雉鹑,蓝鹇,白鹤,遗鸥,白肩雕,拟兀鹫,胡兀鹫,褐马鸡,孔雀雉,绿孔雀
,黑颈鹤,白头鹤,丹顶鹤,赤颈鹤,玉带海雕,白尾海雕,虎头海雕,细嘴松鸡,斑尾榛鸡,黑头角雉,红胸角雉,灰腹角雉,黄腹角雉,黑长尾雉,鸨,短尾信天翁
,白腹军舰鸟,秋沙鸭,山鹧鸪,虹雉,黑颈长尾雉,白颈长尾雉,豺,猕猴,黑熊,棕熊,马熊,石貂,水獭,猞猁,兔狲,金猫,渔猫,河麂,马鹿,水鹿
,臀鹿,驼鹿,黄羊,斑羚,岩羊,盘羊,雪兔,短尾猴,藏酋猴,穿山甲,小熊猫,黄喉貂,斑林狸,大灵猫,小灵猫,荒漠猫,丛林猫,藏原羚,鹅喉羚,海南兔
,巨松鼠,鳍足目,小爪水獭,草原斑猫,麝,塔里木兔,鲸,地龟,玳瑁,大鲵,绿海龟,山瑞鳖,大壁虎,虎纹蛙,棱皮龟,凹甲陆龟,细痣疣螈,镇海疣螈,疣螈
,大凉疣螈,细瘰疣螈,三线闭壳龟,壳龟,丽龟,鸟类,岩鹭,小苇,彩鹳,白鹮,黑鹮,鸳鸯,雪鸡,血雉,黑鹇,原鸡,勺鸡,灰鹤,灰燕,小鸥,白鹇,彩鹮
,角,海鸬鹚,白琵鹭,白额雁,黑琴鸡,柳雷鸟,岩雷鸟,镰翅鸟,藏马鸡,蓝马鸡,沙秋鹤,蓑羽鹤,姬田鸡,花田鸡,黑浮鸥,鸮形目,犀鸟科,阔嘴鸟,小杓鹬
,白枕鹤,赤颈,黑颈鸬鹚,虎斑,黑脸琵鹭,红胸黑雁,红腹角雉,长脚秧鸡,棕背田鸡,铜翅水雉,小青脚鹬,黑腹沙鸡,黑颏果鸠,斑尾林鸽,凤头雨燕,橙胸咬鹃
,蓝耳翠鸟,黑胸蜂虎,绿喉蜂虎,鹤嘴翠鸟,花尾榛鸡,黄嘴白鹭,鹈鹕,鲣鸟,天鹅,隼科,白冠长尾雉,锦鸡,黄嘴河燕鸥,绿鸠,皇鸠,鹃鸠,鸦鹃,八色鸫科
,鹦鹉科科,哺乳动物,树懒,斑马,狗狐熊象,豹子,麝牛,狮子,疣猪,羚羊,驯鹿,考拉,犀牛,长颈鹿,熊猫,食蚁兽,猩猩,海牛,灵猫,海豚,海象
,鸭嘴兽,刺猬,北极狐,无尾熊,北极熊,袋鼠,犰狳,河马,海豹,鲸鱼,鼬,龙鱼,塘鳢,鲶鱼,鲨鱼,章鱼,刺鱼目,鲱形目,鲵,鳅鱼,鳟鱼,锦鲤
,鲀鱼,神仙鱼,鳗鲡,热带鱼,鲽形目,鰕虎鱼,鳄鱼,鲈鱼,鳐鱼,鲤鱼,鳢鱼,金枪鱼,深海鱼,鲟鱼,鲑鱼,鮋鱼,杜父鱼,鳢形目,淡水鱼,孔雀鱼
,鹰鹭鹅,企鹅,犀鸟,隼鹳,松鸡,鹦鹉,啄木鸟,鸮鹮,鸵鸟,翠鸟,蜂鸟,信天翁,鹤雉,夜鹰,海鸥,鸸鹋,北极燕鸥,两栖动物,海狮,龟,蜥蜴
,龟鳖,蟾蜍,昆虫,蝴蝶,蜻蜓,蝎子,吸虫,珊瑚,纤毛虫,绦虫,螈,蚓螈,肉足虫,藤壶,水蚤,水蛭,蟋蟀,蜈蚣,蝗虫,其他动物,恐龙,草履虫
,海参海蜇,海参,海绵,水母,水螅,海星,乌贼,海葵,海胆,树懒斑马,狮子小熊猫,海豚海象,犰狳河马,陆龟地龟,大鲵绿海龟,闭壳龟,鹳松鸡,鸵鸟翠鸟
,燕鸥岩鹭,黑鹇原鸡,彩鹮角,白枕鹤赤颈,鹃鸠鸦鹃,遗鸥白肩雕,巴厘虎,仓鼠,臭鼬,东北虎,非洲象,狒狒,海狗,狐狸,华南虎,灰狼,家鼠,金钱豹
,老虎,老鼠,类人猿,猫,猛犸象,孟加拉虎,苏门答腊虎,新疆虎,羊驼,原驼,中国狼,爪哇虎,鱼类,带鱼,飞鱼,鲱鱼,海葵鱼,河豚,鲫鱼,泥鳅
,平鱼,小丑鱼,鳕鱼,鮋,八哥,白头翁,大雁,猫头鹰,鳖,海龟,海蜇,甲鱼,蚂蚱,青蛙,蚯蚓,三叶虫,珊瑚虫,中华草龟,鹳夜鹰,蜘蛛,狮,蜜蜂
,黑猩猩,蝙蝠,鳄,猪,鲨,牛,兔,章,鱼,青,蛙,北极蝴蝶,鸽子,蜗仓鼠,羊,麻雀,金鱼,乌鸦,变色龙,龙虾,萤火虫,龙,猛犸,猩松螃
,食人鱼,眼镜蛇,斑胸,草雀,知了,蜈虎,蚕,大猩猩,海蛞蝓,乌海,骆刺,浣熊,绵羊,电鳗,野猪,鸭子,屎壳蓝鲸,伊犁,藏獒,燕子,猎豹,海鸟
,奶牛,三文鱼,螳螂虾,燕隼,水熊虫,秃鹫,裸鼹鼠,白鲸,中华鲟,海蟾蜍,白蚁,火鸡,山羊,锯鳐,仙女虾,壁虎,斑鳖,鱿鱼,寄生虫,象龟,非洲肺鱼
,冬虫夏草,候鸟,倭黑猩猩,毛虫,豪猪,鹦鹉螺,帝企鹅,箭毒蛙,牦牛,斑马鱼,螨虫,军舰鸟,牡蛎,金蝉,寄生蜂,鲎,秋刀鱼,美人鱼,黑脉金斑蝶,白犀牛
,霸王龙,老鹰,疣猪鹰,信鸽,狼蛛,蝾螈,飞蛾,火烈鸟,蛞蝓,杜鹃,食骨蠕虫,锤头鲨,月鱼,露脊鲸,渡渡鸟,马陆,帝王蝶,千足虫,蜂鸟鹰蛾,抹香鲸,板足鲎
,鬣狗,野猫,熊蜂,沙猫,蚜虫,滇金丝猴,鹦鹉鱼,公鸡,栉水母,血吸虫,鲸鲨,狨猴,砗磲,射水鱼,跳鼠,美洲鳗,小蓝企鹅,沧龙,翻车鱼,虱子,行军蚁,帽贝
,弹涂鱼,戴胜,飞猫,始祖鸟,负鼠,双髻鲨,切叶蚁,扇贝,响尾蛇,须翡翠,雪貂,洞狮,蛐蛐,金龙鱼,蝈蝈,长毛象,泰迪,狐猴,杜兹肺鱼,海燕,画眉,蛔虫
,六须鲶鱼,草鱼,水熊,灰熊,奇翼龙,娃娃鱼,魟鱼,逆戟鲸,非洲灰,红点齿蟾,遗鸥水牛,土拔鼠,蝌蚪,白颊林莺,毛毛虫,蛇颈龙,豹猫,红腹锦鸡,赛加羚羊,暴龙
,海月水母,喜鹊,中华鳖,磷虾,布谷鸟,织纹螺,巨猿,吉娃娃,大黄蜂,象拔蚌,跳蚤,臭虫,攀鲈鱼,蜘蛛蟹,大王具足虫,红珊瑚,帆水母,四川短翅莺,巨脉蜻蜓,啄羊鹦鹉
,射炮步甲,弥曼始今鸟,鸊鷉,放屁虫,白颊山雀,多鳍鱼,智利龙,貉,蜜獾,金毛,冈比亚鼠,北美负鼠,震旦鸦雀,火玫瑰蜘蛛,绿鬣蜥,云猫,婆罗洲犀牛,口袋鲨,吸血蝙蝠
,巨型蜘蛛蟹,齿猛蚁,跳蛛,贻贝,桶水母,椋鸟,黑犀牛,弓形虫,扁头摄魂蜂,旅鼠,中华花龟,大银鱼,毛丝鼠,红嘴相思鸟,绿毛龟,鼓虾,麦蚜,沙漠穹蛛,纽虫,羞死鸟
,黄鹂,颚口线虫,陷阱颚蚁,红树林树雀,高智商动物,布偶猫,大鼠,安哥拉兔,阿马乌童蛙,蜱虫,变形蛙,褐飞虱猎鹰,螳水蝇,复变甲,钩翅石蛾,旌蛉,蚊蝎蛉,驴线虫,缅因猫
,火体虫,南美洲栗鼠,沟齿鼩,腔棘鱼猿猴,孔雀跳蛛,红色动物,透明鱼,盔犀鸟,隐尾蠊,白头鹫,赛马,灰鲸,雷龙,短尾猫,虫,白兔,假鳃鳉鱼,大角羊,德国蜚蠊,美洲蜚蠊
,吸血虫,龙王鲸,加拉帕格斯,新疆北鲵,枯叶蝴蝶,查菲窄尾魟,猫猴,地中海实蝇,田猫狸,灶马,突灶螽,燕八哥,穴居沙龟,家兔,羚牛,鳜鱼,太平洋丽龟,美洲豹,面包虫
,印度星龟,蚁蜂,金丝熊,鼠狐猴,王企鹅,松鼠猴,麝香猫,虹鳟鱼,姬鼠,罗汉鱼,邓氏鱼,东方剑齿象,大马哈鱼,针尾鸭,鸮鹦鹉,草原田鼠,虎皮鹦鹉,科莫多巨蜥,树龙虾
,卷尾猴,招潮蟹,虾蛄,亚洲鲤鱼,海南长臂猿,海狸鼠,观赏鱼,真涡虫,三星盘虫,黑水虻,香港后棱蛇,颌针鱼,鬣鳞蜥,盲蛇,大山雀,加州神鹫,蝰蛇,原深茗荷,石鳖,蓝顶蓝饰雀
,植狡蛛,弓头鲸,胡狼,智利隐蛛,中国小鲵,火箭蛙,食虫虻,大白鼠,美国负鼠,猪鼻蛇,铃蟾,栉龙,枯叶蛙,黄螺,叶蝇,雨燕,安邦雀鲷,云南盘鮈鱼,蓝喉锯缘蜥,卷羽鹈鹕,蟹蛛
,变色树蜥,缅甸蟒,帝王蟹,小头鼠海豚,奇异盗蛛,丽鱼科鱼,崖燕,斗鱼,火蚁,长吻海蛇,角岛鲸,鳙鱼,鲢鱼,郊狼,青鱼,缺翅虫,中原豫俊兽,猪鼻龟,斑纹隐小鳉,蛤蜊,清道夫
,吼猴,巴西涡螺,美凤蝶,皱鳃鲨,星鼻鼹,埋葬虫,赤狐,竹节虫,乌桕大蚕蛾,垩鮨,伯劳,黄鼬,非洲刺毛鼠,倭河马,壁蜂,白足鼠,红腹灰雀,独角鲸,蝠鲼,角蛙,两头蛇,椿象
,白腰文鸟,黄金箭毒蛙,鱼龙,刀鱼,沙丁鱼,蛇獴,大蚁蛛,滑翔蚁,袋狼,侏鸬鹚,鹿豚,w卷毛野猪,须猪,红河猪,面象虫,捕鱼蛛,香猪,长耳鸮,秋麒麟蟹蛛,袋獾,绿水蚺,红背蜘蛛
,大林猪,白胸苦恶鸟,小䴙䴘,黄金蟒,银背艾蛛,虾虎鱼,海蜘蛛,阴虱,烟蛙,弓背蚁,王蛇,恐鸟,豹纹鲨,前口蝠鲼,镰刀龙,大王乌贼,金丝蛛,钳嘴鹳,白鳍豚,北美星鸦,布氏幽蛙
,宽吻海豚,瘰螈,金线鲃,大旋鳃虫,剑齿虎,尖嘴地雀,树蛙,鳄雀鳝,巨颊龙,长须鲸,江豚,雕齿兽,壶瓶山鮡,孔雀,三趾树懒,日本大山雀,彩蝠,寇蛛,加拿大黑雁,灰雁,侏儒狨
,条纹斑竹鲨,草蛉,盲蛛,山鸡细趾蟾,冰海精灵,鮟鱇,夜鹭,豆丁海马,猪鼻鼠,扁形虫,沙皮狗,蠕虫,三宝鸟,火燕,白鹭,振元龙,利兹鱼,海鬣蜥,咖啡果小蠹,食蜂鸟,涡虫
,叉尾卷尾鸟,五步蛇,棉尾兔,黑游蛇,虎纹伯劳鸟,斑头雁,黄鳝,食蚊鱼,猛鲑,叶水蚤,龙虱,画眉鸟,小香猪,尸鳖,蛇鳄龟,对虾,虾,北美旅鸽,非洲金豺,小黄鱼,田螺,沙虫
,钩盲蛇,细尾鹩莺,刺肩蝽,夜莺,北岛垂耳鸦,三眼恐龙虾,荷兰侏儒兔,峨眉龙,狮虎兽,野象,华庭鸟,比索鸟,撒哈拉银蚁,黇鹿,鳄龟,笑翠鸟,牛蛙,红毛猩猩,短尾矮袋鼠,刺背鳄蜥
,野狼,禾花雀,白色鼠海豚,接吻鱼,东涛鸡,迅猛龙,隐翅虫,斑嘴环企鹅,阿根廷蚂蚁,栗冠弯嘴鹛,蓝极乐鸟,奇虾,鲥鱼,小龙虾,树袋熊,榛鸡,大鳄龟,红狼,巨齿鲨,黄昏鸟,魔鬼蛙
,怪诞虫,切蛋鱼,水滴鱼,蛾子,戴胜鸟,长喙龙,海王龙,恐猫,冥河龙,负子蟾蜍,海猴子,鼬獾,绒山羊,恐狼,石斑鱼,石龙子蜥蜴,狼鱼,蛇雕,黄腹水蛇,椰子螺,高脚蛛,走鹃
,大乌鞘蛇,印花蛇,狮子鱼,斑驴,甲龙,金蟾蜍,巴西卷尾猴,大箭鱼,鮟鱇鱼,绿太阳鱼,非洲野狗,翼龙,马鬃蛇,中华白海豚,田凫,蠵龟,鲳鱼,黄粉虫,王锦蛇,山魈,海兔,切胸蚁
,远古海狸兽,青头潜鸭,巢鼠,山雀,金斑喙凤蝶,丽星鹩鹛,凯门鳄,黑寡妇蜘蛛,旅鸟,马蜂,留鸟,巴西龟,漏斗网蜘蛛,濑尿虾,洞螈,六不像,黑足雪貂,赤眼蜂,姥鲨,锯腹脂鲤
,北小麝鼩,长江江豚,金丝燕,高黎贡羚牛,鬼面天蛾,鹰獒,黄蜂,狗鱼,大型蚤,雪人蟹,华脐鱼,沙漠雨蛙,格林胄蛙,中龙,藏羚羊,扁嘴海雀,长耳跳鼠,慈鲷,巴西胡峰,石鱼,海蛇
,蛇头蝶,棘冠海星,非洲大蜗牛,勺嘴鹬,血红龙鱼,钓鱼猫,七鳃鳗,负子蝽,越中巨齿蛉,田鼠,九棘刺鱼,青斑蝶,巴西游走蛛,巨蟹蛛,三突花蛛,泡蟾,瓢虫茧蜂,刻绒茧蜂,阿里山龙胆
,矮牵牛,矮樱,安祖花,霸王鞭,八角茴香,八角金盘,巴豆,败酱草,白花藿香蓟,白花蛇舌草,白鹤芋,白芨,百合,白蚂蚁花,白毛杜鹃,白屈菜,白檀,白头翁,百日草,白网纹草,白纹竹芋
,白英,白玉兰,百脉根,百子莲,半边莲,半支莲,般若,斑唇马先蒿,斑点橐吾,斑点虎耳草,斑叶凤梨,斑叶马醉木,板栗,报春花,宝莲花,宝绿,苞叶雪莲,北细辛,碧桃,笔筒草,变叶木
,扁豆,扁蓄,滨旋花,薄荷,菠萝,波斯菊,布纹球,补骨脂,彩苞凤梨,彩虹竹芋,彩色马蹄莲,彩叶草,彩云球,苍耳子,苍山虎耳草,草甸马先蒿,草莓果,草玉梅,侧花钓钟柳,檀香
,长瓣瑞香,长鞭红景天,长柄岩黄芪,长刺白龙,长春花,长梗蓼,长花党参,长裂乌头,长蕊万寿竹,长寿花,长筒石蒜,长尾婆婆纳,长行天南星,长叶大戟,长叶兰,昌都点地梅,常青藤,巢蕨
,车前草,秤锤树,沉香,齿时忍冬,齿叶忍冬,重瓣黄木香,臭草,臭党参,丑角花,臭牡丹,雏菊,穿心莲,穿心莛子藨,川楝子,川滇杓兰,川滇蔷薇,川藏沙参,垂红忍冬,垂盆草,刺蓬花
,粗毛肉果草,粗毛薯藤,翠菊,翠雀,翠云草,喙毛马先蒿,打火草,打破碗花花,大百合,大萼蓝钟花,大花芙蓉葵,大花黄牡丹,大花剪秋罗,大花老鹤草,大花肋柱花,大花蔓龙胆,大花曼陀罗
,大草寇,大理花,大花葱,大花蕙兰,大花延龄草,大丽菊,大瘤瓣兰,大象牙参,大岩桐,大叶黄杨,大轮柱,大王黛粉叶,大叶碎米荞,大枣,代代花枳,带叶兜兰,淡竹叶,倒挂金钟,地肤子
,地锦草,地椒,帝冠,地念,地涌金莲,垫状点地梅,吊兰,丁香,东方罂粟,东陵八仙花,冬瓜皮,豆瓣绿,杜鹃,独蒜兰,独一味,短梗重楼,多刺绿融蒿,多花报春,多花孔雀葵,多花亚菊
,多蕊金丝桃,峨嵋蔷薇,鹅毛玉凤兰,鹅掌柴,鹅掌揪,二叶独蒜兰,翻白草,番红花,繁星花,非洲凤仙花,非洲紫罗兰,翡翠景天,绯牡丹,粉背野丁香,粉藤,风车,风车草,辐冠党参,扶郎花
,覆盆子,馥郁滇丁香,柑橘,甘遂,甘肃棘豆,甘肃荚迷,甘西鼠尾草,杠板归,高山白珠树,拱形绣线菊,狗尾红,构骨,枸桔,古代稀,孤挺花,姑婆芋,瓜栗,瓜叶菊,瓜子金,观赏椒,观音竹
,贯叶忍冬,广东万年青,广藿香,广玉兰,光核桃,龟背竹,桂花,桂竹香,鬼箭锦鸡儿,哈密瓜,海角樱草,海棠花,海桐,海州常山,海芋,含笑,含羞草,旱菜,旱金莲,韩国草,荷花
,荷花木兰,荷包牡丹,禾叶竹叶兰,合果芋,合欢,何氏凤仙,鹤虱,核桃,黑蕊老鹳草,黑眼菊,红豆蔻,红花,红花葱兰,红花山牵牛,红花石蒜,红花酢浆草,红姜花,红蕉,红千层,红丝姜花
,红桑,红果仔,红紫桂竹香,珙桐,喉斑杜鹃,厚叶雀舌兰,忽地笑,蝴蝶花,蝴蝶兰,蝴蝶石斛,蝴蝶戏珠花,虎耳草,虎眼万年青,虎耳兰,虎刺梅,互叶铁线莲,华丽龙胆,化橘红,华中五味子
,槐米,换锦花,黄杯杜鹃,黄蝉兰,黄菖蒲,黄刺玫,黄荆子,黄韭兰,黄花酢酱草,黄花凤仙花,黄花鹤顶兰,黄蝉,黄雪光,黄连木,黄毛掌,黄秋葵,黄山紫荆,黄蜀葵,火把花,火红杜鹃
,火棘,火炬花,火麻仁,火星花,火剑凤梨,藿香,蓟花山龙眼,鸡蛋花,鸡冠花,鸡矢藤,疾藜,嘉德利亚兰,架棚假俭草,假茉莉,假昙花,假吐金菊,夹竹桃,建兰,尖子木,姜花,降香
,绞股蓝,缫丝花,睫穗蓼,接骨木,结香花,锦带花,锦灯笼,金边富贵竹,金边石菖蒲,金脉爵床,金脉单药花,金脉鸢尾,金心胡颓子,金凤花,金琥,金鸡菊,金露花,金钱草,金银花,金樱子
,金花茶,金红花,金莲花,金盏菊,筋骨草,荆芥,景天,景天三七,镜面草,九里香,酒瓶兰,菊花,菊花桃,巨伞钟报春,巨紫荆,卷鞘鸢尾,卷叶黄精,蕨麻委陵菜,君子兰,卡特兰,康乃馨
,诃子,孔雀草,孔雀木,空心莲子草,口红花,苦木,宽叶吊兰,宽叶仙女木,宽柱鸢尾,盔檐南星,阔瓣嘉兰,喇叭水仙,拉康龙胆,蜡瓣花,拉萨小檗,兰花,蓝刺头,蓝玉簪龙胆,老虎须,荔枝草
,连钱草,连翘,莲花草,量天尺,列当,裂膜蔓龙胆,鳞秕泽米铁,鳞腺杜鹃,林芝报春花,林芝杜鹃,令箭茶花,令箭荷花,铃兰,凌霄,六出花,留兰香,柳兰,柳条杜鹃,龙柏,龙葵,龙船花
,龙吐珠,龙凤牡丹,龙女花,龙舌兰,龙眼,耧斗菜,芦荟,鹿角海棠,鹿角蕨,路路通,陆英,落葵,卵萼红景天,萝卜秦艽,罗汉果,罗汉松,蟆叶秋海棠,麻黄,麻叶绣球,马鞭草,马齿苋树
,马蹄莲,马兜铃,马拉巴栗,发财树,蔓荆子,毛盔马先蒿,毛汉十二卷,毛花忍冬,毛麝香,毛叶莲花掌,毛叶山梅花,茅莓,梅花,梅子,美丽棱子芹,美女樱,美人蕉,密蒙花,绵刺头菊,绵头蓟
,冥楂,墨旱莲,茉莉,木兰杜鹃,穆坪紫堇,纳里花,南美水仙,南天竹,南洋杉,闹羊花,尼泊尔香青,鸟羽玉,聂拉木独活,牛顿草,牛蒡子,浓香探春,糯米条,女贞子,欧洲卫矛,欧洲银莲花
,爬山虎,蟛蜞菊,螃蟹甲,泡桐花,炮仗花,佩兰,蓬莱珍,皮尔逊金铃,啤酒花,枇杷苹果,瓶耳小草,平枝栒子,菩提花,菩提树,蒲包花,蒲公英,蒲黄,葡萄,葡萄风信子,气球花,七叶树
,七叶莲,七页一枝花,荠菜,麒麟花,千里光,千屈菜,千日红,蔷薇,俏黄芦,楔叶绣线菊,琴叶喜林芋,青果,青珊瑚,青蒿,青锁龙,青麻,琼花,秋葵,秋水仙,秋海棠,秋叶菊,球根秋海棠
,球花马蓝,趣情莲,瞿麦,曲序南星,雀舌黄杨,缺叶钟报春,日本毛玉兰,绒毛掌,榕树,绒叶喜林芋,肉穗野牡丹,乳茄,卵萼花锚,瑞香,瑞云,三白草,三花杜鹃,三尖栝楼,三棱虾脊兰
,三色堇,三色龙血树,三叶鬼针草,三褶虾脊兰,三角花,散鳞杜鹃,散穗黄堇,散尾葵,桑树,森氏杜鹃,沙漠玫瑰,沙棘,山茶花,山地豆,山芙蓉,山梅花,山居雪林芝,山银花,山影拳
,山育杜鹃,山玉兰,山楂,山茱萸,扇叶蒲葵,扇叶铁线蕨,珊瑚刺桐,珊瑚花,珊瑚树,珊瑚藤,芍药,蛇鞭菊,蛇床子,蛇莓,石峰杜鹃,石碱草,石榴,柿蒂,柿子,绶草,蜀秔子梢
,蜀葵,鼠曲草,鼠尾掌,鼠麴舅,束花石斛,双穗雀,水仙,水鬼蕉,水红花子,水晶兰,水飞蓟,水塔花,水杨梅,睡莲,松花粉,松毛翠,松竹草,松霞,苏木,苏铁,宿根福禄考,硕花马先蒿
,昙花,唐菖蒲,糖芥,台湾百合,台湾菜,台湾及己,台湾藜芦,台湾水鸭脚,台湾天南星,台湾一叶兰,台湾笑靥花,桃金娘,桃花,桃子,桃儿七,桃叶珊瑚,天蓝龙胆,天门冬,天胡荽
,铁苋菜,铁线草,铁线莲,头状四照花,土丁桂,兔儿菜,团叶越桔,团羽铁线蕨,瓦松,苣叶秃疮花,勿忘草,五彩红星,五色梅,五色苋,五针松,五爪金龙,吴茱萸,乌心石,乌蔹莓
,乌毛蕨,乌臼,西番莲,西瓜,西瓜皮椒草,西班牙鸢尾,西府海棠,西南吊兰,西南花楸,西藏粉报春,西藏锦鸡儿,西藏龙胆,西藏铁线莲,西藏卫矛,喜普鞋兰,喜树果,希莶草,菥冥
,狭萼风吹箫,虾脊兰,虾夷花,夏枯草,夏水仙,仙丹花,仙客来,仙鹤草,仙人笔,仙人掌,仙人指,咸丰草,腺叶酢浆草,香豆蔻,香蕉,香雪球,香龙血树,香橼,向日葵,相思树
,橡皮树,象南星,象牙红,辛夷,小仓兰,小果子蔓,小蓟,小花龙舌兰,小茴香,小丽花,小毛毡苔,小虾花,小叶红叶藤,小叶栒子,星状雪兔子,绣球藤,袖珍椰子,须弥紫菀,旋覆花
,悬铃花,萱草,旋花,雪滴花,雪莲花,雪茄花,雪山翻白草,血红蕉,血苋,熏衣草,鸦胆子,鸭跖草,艳凤梨,艳红赫蕉,雁来红,岩生银莲花,沿阶草,燕子掌,阳春砂,洋金花
,羊蹄甲,杨梅,咬人猫,野颠茄,野菊花,野马追,野牡丹,野苋,野山楂,野塘蒿,夜合花,夜来香,叶下珠,叶子花,椰子,腋花扭柄花,一点红,一叶兰,一串红,一品红,一枝黄花
,异叶千里光,益母草,益智,鸢尾,茵陈,茵芋,淫羊藿,硬毛杜鹃,迎春花,樱花,樱桃,玉牛掌,玉山薄雪草,玉竹,玉山佛甲草,玉山水苦贾,玉叶金花,玉簪,羽扇豆,羽叶茑萝
,羽裂喜林芋,榆叶梅,虞美人,鱼腹草,预知子,圆齿红景天,圆盾状忍冬,芫花,芫荽,缘毛紫菀,月宫殿,月季,月橘,勋章花,云锦杜鹃,云南勾儿茶,云南杓兰,云实云杉,杂色钟报春
,杂种落新妇,藏波罗花,藏南杜鹃,藏南粉报春,藏玄参,枣子,泽兰,泽漆,窄花凤仙花,展毛翠雀花,樟木,昭和草,贞凤梨,栀子,栀子花,蜘蛛抱蛋,肿柄雪莲,肿节风,中国马先蒿
,朱顶红,朱砂桔,朱缨花,竹叶椒,诸葛菜,楮实子,爪哇常山,醉蝶花,紫玉兰,紫荆花,紫金牛,紫薇,紫背草,紫背万年青,紫鹅绒,紫海葱,紫花藿香蓟,紫花凤梨,紫露草,紫参
,紫心草,紫罗兰,紫玉盘杜鹃,紫菀,棕榈,棕竹,总状绿绒蒿,滴水观音,生石花,蟹爪,泥鳅掌,松鼠尾,四季海棠,文殊兰,银芽柳,心叶冰花,喷火龙,龟甲龙,心叶球兰,爱之蔓
,花叶爱之蔓,金玉菊,棒棰树,斑马萝摩,白雪姬,白菩提,白马城,白佛甲,阿修罗城,八宝,大和锦,大缠,春峰锦,垂悬大戟,橙黄棒叶花,吹上,棒叶花,佛肚树,凤尾兰,费菜
,翡翠珠,方茎青紫葛,灯笼花,非洲霸王树,反曲景天,大戟阁锦,大花犀角,黑法师,褐斑伽蓝,何布景天,过手香,贵青玉,龟纹木棉,鬼角子,光棍树,高文鹰爪,佛甲草,宫灯长寿花
,金边虎尾兰,短叶虎尾兰,棒叶虎尾兰,白肋虎尾兰,虎尾兰,红叶之秋,红怒涛,红龙骨,红雀珊瑚,龙骨,将军,剑麻,姬星美人,姬凤梨,火祭,火秧勒,黄花胡麻,幻蝶蔓,华丽景天
,花月夜,辣木,菊水,快刀乱麻,九轮塔,金边千手兰,金边龙舌兰,将军阁,金边凤梨,腊梅,艾菊,芭蕉,白鲜,宝巾,贝母,滨菊,稠李,春兰,慈姑,刺槐,刺桐,葱兰,大蓟
,大青,大薸,大戟,地肤,地锦,蝶豆,冬青,杜梨,番薯,繁缕,肺衣,扶桑,海棠,红蓼,花葵,花忍,花烛,黄翁,黄杨,黄芩,黄栌,黄橘,幌菊,鸡麻,继木,嘉兰,荚蒾
,姜黄,角蒿,结香,金柑,锦葵,菊蒿,卷耳,决明,款冬,葵菊,蜡花,蜡菊,梨花,莲翘,龙胆,芦竹,绿萝,络石,马兰,玫瑰,米兰,魔芋,牡丹,母菊,木瓜,木棉,射干
,肾蕨,石蒜,石竹,石楠,石斛,水鳖,水苏,水芋,水蕹,硕葱,丝兰,酸浆,蒜松,田菁,铁兰,王莲,卫矛,文竹,翁柱,乌头,希稗,细辛,霞草,仙茅,襄荷,小檗,械葵
,星球,杏花,雪松,岩芋,依兰,银花,银杏,银叶,樱草,迎春,油桐,雨菊,玉兰,郁金,郁李,圆柏,月桂,云实,泽泻,知母,珠兰,朱蕉,著草,紫荆,紫藤,紫苑,紫珠
,赪桐,芙蓉,芸香,茑萝,茜草,荭草,菖蒲,蒿菊,蒺瑰,猬实,溲疏,缬草,杓兰,枸骨,枸杞,柽柳,栾树,桉树,桫椤,棣棠`

var (
	nickNameList []string
	defaultRand  = rand.New(rand.NewSource(time.Now().UnixNano()))
)

func LoadNickName() {
	nickNameList = strings.Split(nickName, ",")
}

func GetNickName() string {
	if len(nickNameList) == 0 {
		nickNameList = strings.Split(nickName, ",")
	}
	name := nickNameList[defaultRand.Intn(len(nickNameList))]
	return strings.TrimSpace(name)
}
